* Dates in python
I have some need for some convenient date handling. I have files where I want a convenient date format like (2013, 11, 12), which I want to parse, and figure out if it is earlier than today.

#+BEGIN_SRC python
import datetime

d = (2013, 11, 12)

today = datetime.date.today()

print today > datetime.date(*d)
print today
#+END_SRC

#+RESULTS:
: True
: 2013-11-15

